#include <stdio.h>
#include <inttypes.h>
#include <err.h>
#include <string.h>

#include <unistd.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#include <stdlib.h>

/**
 *  Задача Б може да се реши чрез k-way merge sort. Тоест сортиране чрез сливане на k
 *  на брой редици. Входът се разбива на k на брой парчета, където всяко парче е с равен
 *  размер, достатъчно малък за побиране в памета. Всяко парче се сортира с произволен
 *  алрогитъм самостоятелно и после успоредно се прочитат равни части от всяка от k-те
 *  редици.
 *
 *  имах такова домашно при Армянов..
 *
 */

